// Дано число больше 9. Вывести на экран  вторую цифру числа с конца


double a= 15;
System.Console.WriteLine(a/10); //Так деление

int b= 15;
System.Console.WriteLine(b/10); //Так мы получаем вторую цифру числа с конца

int с= 135;
System.Console.WriteLine(с/10%10);// %-остаток от деления, позволяет увидеть вторую цифру с конца. 

